GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32c113r(b)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "gd32c113xx-afio.h"

/* ADC01_IN0 */
#define ADC01_IN0_PA0 \
	GD32_PINMUX_AFIO('A', 0, ANALOG, NORMP)

/* ADC01_IN1 */
#define ADC01_IN1_PA1 \
	GD32_PINMUX_AFIO('A', 1, ANALOG, NORMP)

/* ADC01_IN10 */
#define ADC01_IN10_PC0 \
	GD32_PINMUX_AFIO('C', 0, ANALOG, NORMP)

/* ADC01_IN11 */
#define ADC01_IN11_PC1 \
	GD32_PINMUX_AFIO('C', 1, ANALOG, NORMP)

/* ADC01_IN12 */
#define ADC01_IN12_PC2 \
	GD32_PINMUX_AFIO('C', 2, ANALOG, NORMP)

/* ADC01_IN13 */
#define ADC01_IN13_PC3 \
	GD32_PINMUX_AFIO('C', 3, ANALOG, NORMP)

/* ADC01_IN14 */
#define ADC01_IN14_PC4 \
	GD32_PINMUX_AFIO('C', 4, ANALOG, NORMP)

/* ADC01_IN15 */
#define ADC01_IN15_PC5 \
	GD32_PINMUX_AFIO('C', 5, ANALOG, NORMP)

/* ADC01_IN2 */
#define ADC01_IN2_PA2 \
	GD32_PINMUX_AFIO('A', 2, ANALOG, NORMP)

/* ADC01_IN3 */
#define ADC01_IN3_PA3 \
	GD32_PINMUX_AFIO('A', 3, ANALOG, NORMP)

/* ADC01_IN4 */
#define ADC01_IN4_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)

/* ADC01_IN5 */
#define ADC01_IN5_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)

/* ADC01_IN6 */
#define ADC01_IN6_PA6 \
	GD32_PINMUX_AFIO('A', 6, ANALOG, NORMP)

/* ADC01_IN7 */
#define ADC01_IN7_PA7 \
	GD32_PINMUX_AFIO('A', 7, ANALOG, NORMP)

/* ADC01_IN8 */
#define ADC01_IN8_PB0 \
	GD32_PINMUX_AFIO('B', 0, ANALOG, NORMP)

/* ADC01_IN9 */
#define ADC01_IN9_PB1 \
	GD32_PINMUX_AFIO('B', 1, ANALOG, NORMP)

/* ANALOG */
#define ANALOG_PA0 \
	GD32_PINMUX_AFIO('A', 0, ANALOG, NORMP)
#define ANALOG_PA1 \
	GD32_PINMUX_AFIO('A', 1, ANALOG, NORMP)
#define ANALOG_PA2 \
	GD32_PINMUX_AFIO('A', 2, ANALOG, NORMP)
#define ANALOG_PA3 \
	GD32_PINMUX_AFIO('A', 3, ANALOG, NORMP)
#define ANALOG_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)
#define ANALOG_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)
#define ANALOG_PA6 \
	GD32_PINMUX_AFIO('A', 6, ANALOG, NORMP)
#define ANALOG_PA7 \
	GD32_PINMUX_AFIO('A', 7, ANALOG, NORMP)
#define ANALOG_PA8 \
	GD32_PINMUX_AFIO('A', 8, ANALOG, NORMP)
#define ANALOG_PA9 \
	GD32_PINMUX_AFIO('A', 9, ANALOG, NORMP)
#define ANALOG_PA10 \
	GD32_PINMUX_AFIO('A', 10, ANALOG, NORMP)
#define ANALOG_PA11 \
	GD32_PINMUX_AFIO('A', 11, ANALOG, NORMP)
#define ANALOG_PA12 \
	GD32_PINMUX_AFIO('A', 12, ANALOG, NORMP)
#define ANALOG_PA13 \
	GD32_PINMUX_AFIO('A', 13, ANALOG, NORMP)
#define ANALOG_PA14 \
	GD32_PINMUX_AFIO('A', 14, ANALOG, NORMP)
#define ANALOG_PA15 \
	GD32_PINMUX_AFIO('A', 15, ANALOG, NORMP)
#define ANALOG_PB0 \
	GD32_PINMUX_AFIO('B', 0, ANALOG, NORMP)
#define ANALOG_PB1 \
	GD32_PINMUX_AFIO('B', 1, ANALOG, NORMP)
#define ANALOG_PB2 \
	GD32_PINMUX_AFIO('B', 2, ANALOG, NORMP)
#define ANALOG_PB3 \
	GD32_PINMUX_AFIO('B', 3, ANALOG, NORMP)
#define ANALOG_PB4 \
	GD32_PINMUX_AFIO('B', 4, ANALOG, NORMP)
#define ANALOG_PB5 \
	GD32_PINMUX_AFIO('B', 5, ANALOG, NORMP)
#define ANALOG_PB6 \
	GD32_PINMUX_AFIO('B', 6, ANALOG, NORMP)
#define ANALOG_PB7 \
	GD32_PINMUX_AFIO('B', 7, ANALOG, NORMP)
#define ANALOG_PB8 \
	GD32_PINMUX_AFIO('B', 8, ANALOG, NORMP)
#define ANALOG_PB9 \
	GD32_PINMUX_AFIO('B', 9, ANALOG, NORMP)
#define ANALOG_PB10 \
	GD32_PINMUX_AFIO('B', 10, ANALOG, NORMP)
#define ANALOG_PB11 \
	GD32_PINMUX_AFIO('B', 11, ANALOG, NORMP)
#define ANALOG_PB12 \
	GD32_PINMUX_AFIO('B', 12, ANALOG, NORMP)
#define ANALOG_PB13 \
	GD32_PINMUX_AFIO('B', 13, ANALOG, NORMP)
#define ANALOG_PB14 \
	GD32_PINMUX_AFIO('B', 14, ANALOG, NORMP)
#define ANALOG_PB15 \
	GD32_PINMUX_AFIO('B', 15, ANALOG, NORMP)
#define ANALOG_PC0 \
	GD32_PINMUX_AFIO('C', 0, ANALOG, NORMP)
#define ANALOG_PC1 \
	GD32_PINMUX_AFIO('C', 1, ANALOG, NORMP)
#define ANALOG_PC2 \
	GD32_PINMUX_AFIO('C', 2, ANALOG, NORMP)
#define ANALOG_PC3 \
	GD32_PINMUX_AFIO('C', 3, ANALOG, NORMP)
#define ANALOG_PC4 \
	GD32_PINMUX_AFIO('C', 4, ANALOG, NORMP)
#define ANALOG_PC5 \
	GD32_PINMUX_AFIO('C', 5, ANALOG, NORMP)
#define ANALOG_PC6 \
	GD32_PINMUX_AFIO('C', 6, ANALOG, NORMP)
#define ANALOG_PC7 \
	GD32_PINMUX_AFIO('C', 7, ANALOG, NORMP)
#define ANALOG_PC8 \
	GD32_PINMUX_AFIO('C', 8, ANALOG, NORMP)
#define ANALOG_PC9 \
	GD32_PINMUX_AFIO('C', 9, ANALOG, NORMP)
#define ANALOG_PC10 \
	GD32_PINMUX_AFIO('C', 10, ANALOG, NORMP)
#define ANALOG_PC11 \
	GD32_PINMUX_AFIO('C', 11, ANALOG, NORMP)
#define ANALOG_PC12 \
	GD32_PINMUX_AFIO('C', 12, ANALOG, NORMP)
#define ANALOG_PC13 \
	GD32_PINMUX_AFIO('C', 13, ANALOG, NORMP)
#define ANALOG_PC14 \
	GD32_PINMUX_AFIO('C', 14, ANALOG, NORMP)
#define ANALOG_PC15 \
	GD32_PINMUX_AFIO('C', 15, ANALOG, NORMP)
#define ANALOG_PD0 \
	GD32_PINMUX_AFIO('D', 0, ANALOG, NORMP)
#define ANALOG_PD1 \
	GD32_PINMUX_AFIO('D', 1, ANALOG, NORMP)
#define ANALOG_PD2 \
	GD32_PINMUX_AFIO('D', 2, ANALOG, NORMP)

/* CAN0_RX */
#define CAN0_RX_PA11_NORMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, CAN0_NORMP)
#define CAN0_RX_PB8_PRMP \
	GD32_PINMUX_AFIO('B', 8, GPIO_IN, CAN0_PRMP)
#define CAN0_RX_PD0_FRMP \
	GD32_PINMUX_AFIO('D', 0, GPIO_IN, CAN0_FRMP)

/* CAN0_TX */
#define CAN0_TX_PA12_NORMP \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, CAN0_NORMP)
#define CAN0_TX_PB9_PRMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, CAN0_PRMP)
#define CAN0_TX_PD1_FRMP \
	GD32_PINMUX_AFIO('D', 1, ALTERNATE, CAN0_FRMP)

/* CAN1_RX */
#define CAN1_RX_PB12_NORMP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, CAN1_NORMP)
#define CAN1_RX_PB5_RMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, CAN1_RMP)

/* CAN1_TX */
#define CAN1_TX_PB13_NORMP \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, CAN1_NORMP)
#define CAN1_TX_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, CAN1_RMP)

/* CK_OUT0 */
#define CK_OUT0_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* CTC_SYNC */
#define CTC_SYNC_PA8_NORMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, CTC_NORMP)

/* DAC0_OUT0 */
#define DAC0_OUT0_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)

/* DAC0_OUT1 */
#define DAC0_OUT1_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)

/* I2C0_SCL */
#define I2C0_SCL_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, I2C0_NORMP)
#define I2C0_SCL_PB8_RMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, I2C0_RMP)

/* I2C0_SDA */
#define I2C0_SDA_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, I2C0_NORMP)
#define I2C0_SDA_PB9_RMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, I2C0_RMP)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

